/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   randomChunmp.cpp                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: toshota <toshota@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/05 15:24:51 by toshota           #+#    #+#             */
/*   Updated: 2024/06/05 16:39:14 by toshota          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"

// 関数の外で使用することのないメモリはスタック領域で確保する
// スタックに作成したゾンビは関数の終わりとともに自動的に削除される
void randomChump(std::string name)
{
	Zombie zombie_stack(name);
	zombie_stack.announce();
}
